/*
 * Copyright (c) 2025 Rumbledethumps
 *
 * SPDX-License-Identifier: BSD-3-Clause
 * SPDX-License-Identifier: Unlicense
 */

// clang-format off

// Contributors: WojciechGw

// PL-PROG - Polish - Programmer's

// HID KEY to Unicode
// {unmodified, shift, altGr, shift + altGr, use caps lock}
#define KBD_LAYOUT_KEYS_PL_PROG \
    /* 0x00    */ {     0,      0,      0,      0, false}, \
    /* 0x01    */ {     0,      0,      0,      0, false}, \
    /* 0x02    */ {     0,      0,      0,      0, false}, \
    /* 0x03    */ {     0,      0,      0,      0, false}, \
    /* 0x04 ąĄ */ {   'a',    'A', 0x0105, 0x0104,  true}, \
    /* 0x05    */ {   'b',    'B',      0,      0,  true}, \
    /* 0x06 ćĆ */ {   'c',    'C', 0x0107, 0x0106,  true}, \
    /* 0x07    */ {   'd',    'D',      0,      0,  true}, \
    /* 0x08 ęĘ */ {   'e',    'E', 0x0119, 0x0118,  true}, \
    /* 0x09    */ {   'f',    'F',      0,      0,  true}, \
    /* 0x0a    */ {   'g',    'G',      0,      0,  true}, \
    /* 0x0b    */ {   'h',    'H',      0,      0,  true}, \
    /* 0x0c    */ {   'i',    'I',      0,      0,  true}, \
    /* 0x0d    */ {   'j',    'J',      0,      0,  true}, \
    /* 0x0e    */ {   'k',    'K',      0,      0,  true}, \
    /* 0x0f łŁ */ {   'l',    'L', 0x0142, 0x0141,  true}, \
    /* 0x10    */ {   'm',    'M',      0,      0,  true}, \
    /* 0x11 ńŃ */ {   'n',    'N', 0x0144, 0x0143,  true}, \
    /* 0x12 óÓ */ {   'o',    'O', 0x00f3, 0x00d3,  true}, \
    /* 0x13    */ {   'p',    'P',      0,      0,  true}, \
    /* 0x14    */ {   'q',    'Q',      0,      0,  true}, \
    /* 0x15    */ {   'r',    'R',      0,      0,  true}, \
    /* 0x16 śŚ */ {   's',    'S', 0x015b, 0x015a,  true}, \
    /* 0x17    */ {   't',    'T',      0,      0,  true}, \
    /* 0x18    */ {   'u',    'U',      0,      0,  true}, \
    /* 0x19    */ {   'v',    'V',      0,      0,  true}, \
    /* 0x1a    */ {   'w',    'W',      0,      0,  true}, \
    /* 0x1b źŹ */ {   'x',    'X', 0x017a, 0x0179,  true}, \
    /* 0x1c    */ {   'y',    'Y',      0,      0,  true}, \
    /* 0x1d żŻ */ {   'z',    'Z', 0x017c, 0x017b,  true}, \
    /* 0x1e    */ {   '1',    '!',      0,      0, false}, \
    /* 0x1f    */ {   '2',    '@',      0,      0, false}, \
    /* 0x20 §  */ {   '3',    '#', 0x00a7,      0, false}, \
    /* 0x21 €  */ {   '4',    '$', 0x20ac,      0, false}, \
    /* 0x22    */ {   '5',    '%',      0,      0, false}, \
    /* 0x23    */ {   '6',    '^',      0,      0, false}, \
    /* 0x24    */ {   '7',    '&',      0,      0, false}, \
    /* 0x25    */ {   '8',    '*',      0,      0, false}, \
    /* 0x26    */ {   '9',    '(',      0,      0, false}, \
    /* 0x27    */ {   '0',    ')',      0,      0, false}, \
    /* 0x28    */ {  '\r',   '\r',      0,      0, false}, \
    /* 0x29    */ {'\x1b', '\x1b',      0,      0, false}, \
    /* 0x2a    */ {'\x7f', '\x7f',      0,      0, false}, \
    /* 0x2b    */ {  '\t',   '\t',      0,      0, false}, \
    /* 0x2c    */ {   ' ',    ' ',      0,      0, false}, \
    /* 0x2d    */ {   '-',    '_',      0,      0, false}, \
    /* 0x2e    */ {   '=',    '+',      0,      0, false}, \
    /* 0x2f    */ {   '[',    '{',      0,      0, false}, \
    /* 0x30    */ {   ']',    '}',      0,      0, false}, \
    /* 0x31    */ {  '\\',    '|',      0,      0, false}, \
    /* 0x32    */ {  '\\',    '|',      0,      0, false}, \
    /* 0x33    */ {   ';',    ':',      0,      0, false}, \
    /* 0x34    */ {  '\'',   '\"',      0,      0, false}, \
    /* 0x35    */ {   '`',    '~',      0,      0, false}, \
    /* 0x36    */ {   ',',    '<',      0,      0, false}, \
    /* 0x37    */ {   '.',    '>',      0,      0, false}, \
    /* 0x38    */ {   '/',    '?',      0,      0, false}, \
    /* 0x39    */ {     0,      0,      0,      0, false}, \
    /* 0x3a    */ {     0,      0,      0,      0, false}, \
    /* 0x3b    */ {     0,      0,      0,      0, false}, \
    /* 0x3c    */ {     0,      0,      0,      0, false}, \
    /* 0x3d    */ {     0,      0,      0,      0, false}, \
    /* 0x3e    */ {     0,      0,      0,      0, false}, \
    /* 0x3f    */ {     0,      0,      0,      0, false}, \
    /* 0x40    */ {     0,      0,      0,      0, false}, \
    /* 0x41    */ {     0,      0,      0,      0, false}, \
    /* 0x42    */ {     0,      0,      0,      0, false}, \
    /* 0x43    */ {     0,      0,      0,      0, false}, \
    /* 0x44    */ {     0,      0,      0,      0, false}, \
    /* 0x45    */ {     0,      0,      0,      0, false}, \
    /* 0x46    */ {     0,      0,      0,      0, false}, \
    /* 0x47    */ {     0,      0,      0,      0, false}, \
    /* 0x48    */ {     0,      0,      0,      0, false}, \
    /* 0x49    */ {     0,      0,      0,      0, false}, \
    /* 0x4a    */ {     0,      0,      0,      0, false}, \
    /* 0x4b    */ {     0,      0,      0,      0, false}, \
    /* 0x4c    */ {     0,      0,      0,      0, false}, \
    /* 0x4d    */ {     0,      0,      0,      0, false}, \
    /* 0x4e    */ {     0,      0,      0,      0, false}, \
    /* 0x4f    */ {     0,      0,      0,      0, false}, \
    /* 0x50    */ {     0,      0,      0,      0, false}, \
    /* 0x51    */ {     0,      0,      0,      0, false}, \
    /* 0x52    */ {     0,      0,      0,      0, false}, \
    /* 0x53    */ {     0,      0,      0,      0, false}, \
    /* 0x54    */ {   '/',    '/',      0,      0, false}, \
    /* 0x55    */ {   '*',    '*',      0,      0, false}, \
    /* 0x56    */ {   '-',    '-',      0,      0, false}, \
    /* 0x57    */ {   '+',    '+',      0,      0, false}, \
    /* 0x58    */ {  '\r',   '\r',      0,      0, false}, \
    /* 0x59    */ {   '1',      0,      0,      0, false}, \
    /* 0x5a    */ {   '2',      0,      0,      0, false}, \
    /* 0x5b    */ {   '3',      0,      0,      0, false}, \
    /* 0x5c    */ {   '4',      0,      0,      0, false}, \
    /* 0x5d    */ {   '5',      0,      0,      0, false}, \
    /* 0x5e    */ {   '6',      0,      0,      0, false}, \
    /* 0x5f    */ {   '7',      0,      0,      0, false}, \
    /* 0x60    */ {   '8',      0,      0,      0, false}, \
    /* 0x61    */ {   '9',      0,      0,      0, false}, \
    /* 0x62    */ {   '0',      0,      0,      0, false}, \
    /* 0x63    */ {   '.',      0,      0,      0, false}, \
    /* 0x64    */ {  '\\',    '|',      0,      0, false}, \
    /* 0x65    */ {     0,      0,      0,      0, false}, \
    /* 0x66    */ {     0,      0,      0,      0, false}, \
    /* 0x67    */ {   '=',    '=',      0,      0, false}, \
    /* 0x68    */ {     0,      0,      0,      0, false}, \
    /* 0x69    */ {     0,      0,      0,      0, false}, \
    /* 0x6a    */ {     0,      0,      0,      0, false}, \
    /* 0x6b    */ {     0,      0,      0,      0, false}, \
    /* 0x6c    */ {     0,      0,      0,      0, false}, \
    /* 0x6d    */ {     0,      0,      0,      0, false}, \
    /* 0x6e    */ {     0,      0,      0,      0, false}, \
    /* 0x6f    */ {     0,      0,      0,      0, false}, \
    /* 0x70    */ {     0,      0,      0,      0, false}, \
    /* 0x71    */ {     0,      0,      0,      0, false}, \
    /* 0x72    */ {     0,      0,      0,      0, false}, \
    /* 0x73    */ {     0,      0,      0,      0, false}, \
    /* 0x74    */ {     0,      0,      0,      0, false}, \
    /* 0x75    */ {     0,      0,      0,      0, false}, \
    /* 0x76    */ {     0,      0,      0,      0, false}, \
    /* 0x77    */ {     0,      0,      0,      0, false}, \
    /* 0x78    */ {     0,      0,      0,      0, false}, \
    /* 0x79    */ {     0,      0,      0,      0, false}, \
    /* 0x7a    */ {     0,      0,      0,      0, false}, \
    /* 0x7b    */ {     0,      0,      0,      0, false}, \
    /* 0x7c    */ {     0,      0,      0,      0, false}, \
    /* 0x7d    */ {     0,      0,      0,      0, false}, \
    /* 0x7e    */ {     0,      0,      0,      0, false}, \
    /* 0x7f    */ {     0,      0,      0,      0, false},

#define KBD_LAYOUT_DEAD2_PL_PROG \
    /* End */ {0}

#define KBD_LAYOUT_DEAD3_PL_PROG \
    /* End */ {0}
